src/main/resources/uml/10-캐시-프로바이더-외부저장소( Redis)-방식.mermaid
flowchart LR
    subgraph 우리 시스템
        subgraph 서버 클러스터
            Server1["서버 1"]
            Server2["서버 2"]
        end
        LB([Load Balancer])
        Redis[(Redis)]
    end

    ExternalApi[[외부 시스템]]
%% 흐름 정의
    LB --> Server1
    LB --> Server2
    Server1 --> Redis
    Server2 --> Redis
    Server1 --> ExternalApi
    Server2 --> ExternalApi
